In [1]:
import pandas as pd

In [3]:
marks = {
    'Student_name':['Kaalu','Sonu','Tinku','Rinku'],
    'Roll_no':[1001,1002,1003,1004],
    'Marks':[98,99,97,95]
}

data = pd.DataFrame(marks)
data

  Student_name  Roll_no  Marks
0        Kaalu     1001     98
1         Sonu     1002     99
2        Tinku     1003     97
3        Rinku     1004     95

In [9]:
#--Reading a file from the pc
data = pd.read_csv("dogs.csv")
data

      Name       Breed  Color  Height (CM)  Weight (Kg) Date of Birth
0    Bella   Labradoor  Brown           56           25      7/1/2013
1  Charlie   Chow Chow  Black           43           23     9/16/2016
2     Lucy      Poodle  Brown           46           22     8/25/2014
3   Cooper   Labradoor   Gray           49           17    12/11/2011
4      Max   Labradoor  Black           59           29     1/20/2017
5    Stela   Chihuahua    Tan           18            2     4/20/2015
6   Bernie  St.Barnard  White           77           74     2/27/2018

In [15]:
data.head(3)#--displays entries from starting to particular point of users choice

      Name      Breed  Color  Height (CM)  Weight (Kg) Date of Birth
0    Bella  Labradoor  Brown           56           25      7/1/2013
1  Charlie  Chow Chow  Black           43           23     9/16/2016
2     Lucy     Poodle  Brown           46           22     8/25/2014

In [14]:
data.tail()#--displays last 5 entries

     Name       Breed  Color  Height (CM)  Weight (Kg) Date of Birth
2    Lucy      Poodle  Brown           46           22     8/25/2014
3  Cooper   Labradoor   Gray           49           17    12/11/2011
4     Max   Labradoor  Black           59           29     1/20/2017
5   Stela   Chihuahua    Tan           18            2     4/20/2015
6  Bernie  St.Barnard  White           77           74     2/27/2018

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           7 non-null      object
 1   Breed          7 non-null      object
 2   Color          7 non-null      object
 3   Height (CM)    7 non-null      int64
 4   Weight (Kg)    7 non-null      int64
 5   Date of Birth  7 non-null      object
dtypes: int64(2), object(4)
memory usage: 468.0+ bytes

In [21]:
#--Attributes--#

In [17]:
data.shape#--gives the rows and columns of the file

(7, 6)

In [18]:
data.values

array([['Bella', 'Labradoor', 'Brown', 56, 25, '7/1/2013'],
       ['Charlie', 'Chow Chow', 'Black', 43, 23, '9/16/2016'],
       ['Lucy', 'Poodle', 'Brown', 46, 22, '8/25/2014'],
       ['Cooper', 'Labradoor', 'Gray', 49, 17, '12/11/2011'],
       ['Max', 'Labradoor', 'Black', 59, 29, '1/20/2017'],
       ['Stela', 'Chihuahua', 'Tan', 18, 2, '4/20/2015'],
       ['Bernie', 'St.Barnard', 'White', 77, 74, '2/27/2018']],
      dtype=object)

In [19]:
data.columns

Index(['Name', 'Breed', 'Color', 'Height (CM)', 'Weight (Kg)',
       'Date of Birth'],
      dtype='object')

In [26]:
data.sort_values('Color')

      Name       Breed  Color  Height (CM)  Weight (Kg) Date of Birth
1  Charlie   Chow Chow  Black           43           23     9/16/2016
4      Max   Labradoor  Black           59           29     1/20/2017
0    Bella   Labradoor  Brown           56           25      7/1/2013
2     Lucy      Poodle  Brown           46           22     8/25/2014
3   Cooper   Labradoor   Gray           49           17    12/11/2011
5    Stela   Chihuahua    Tan           18            2     4/20/2015
6   Bernie  St.Barnard  White           77           74     2/27/2018